// pages/version-log/version-log.ts
Page({

  /**
   * 页面的初始数据
   */
  data: {
    versionLogList: [
      {
        versionName: 'v1.4.1',
        versionDate: '2024-03-06',
        featureList: ['新增插屏和激励广告']
      },
      {
        versionName: 'v1.3.4',
        versionDate: '2024-01-12',
        featureList: ['新增全才英雄','感谢【👨Danny】、【👨随风大侠】两位用户进行功能反馈']
      },
      {
        versionName: 'v1.3.3',
        versionDate: '2023-07-01',
        featureList: ['删除小程序广告位','英雄物品列表调整']
      },
      {
        versionName: 'v1.3.2',
        versionDate: '2023-05-07',
        featureList: ['新增小程序广告位']
      },
      {
        versionName: 'v1.3.1',
        versionDate: '2023-01-05',
        bugFixList: ['修复bug若干', '新增PC端上线Tips']
      },
      {
        versionName: 'v1.3.0',
        versionDate: '2022-12-03',
        bugFixList: ['修复bug若干']
      },
      {
        versionName: 'v1.2.0',
        versionDate: '2022-11-06',
        bugFixList: ['修复bug若干'],
        featureList: ['新增查询战绩功能', '英雄技能页面新增天赋树', '部分交互体验优化']
      },
      {
        versionName: 'v1.1.0',
        versionDate: '2022-11-06',
        bugFixList: ['修复赛事页面报错的bug'],
        featureList: ['新增其他页面，包括关于、联系作者、版本日志等功能', '新增小程序转发功能']
      },
      {
        versionName: 'v1.0.0',
        versionDate: '2022-10-25',
        bugFixList: [],
        featureList: ['第一个版本上线~', '新增英雄物品功能', '新增赛事功能', '新增发现功能', '新增资讯功能']
      },
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad() {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})